; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l7-t1-p10---int100n150-m25---int100c200---s386---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level5 level5)
(sum level0 level9 level9)
(sum level0 level15 level15)
(sum level0 level20 level20)
(sum level0 level21 level21)
(sum level0 level25 level25)
(sum level1 level1 level2)
(sum level1 level5 level6)
(sum level1 level9 level10)
(sum level1 level15 level16)
(sum level1 level20 level21)
(sum level1 level21 level22)
(sum level1 level25 level26)
(sum level2 level1 level3)
(sum level2 level5 level7)
(sum level2 level9 level11)
(sum level2 level15 level17)
(sum level2 level20 level22)
(sum level2 level21 level23)
(sum level2 level25 level27)
(sum level3 level1 level4)
(sum level3 level5 level8)
(sum level3 level9 level12)
(sum level3 level15 level18)
(sum level3 level20 level23)
(sum level3 level21 level24)
(sum level3 level25 level28)
(sum level4 level1 level5)
(sum level4 level5 level9)
(sum level4 level9 level13)
(sum level4 level15 level19)
(sum level4 level20 level24)
(sum level4 level21 level25)
(sum level4 level25 level29)
(sum level5 level1 level6)
(sum level5 level5 level10)
(sum level5 level9 level14)
(sum level5 level15 level20)
(sum level5 level20 level25)
(sum level5 level21 level26)
(sum level5 level25 level30)
(sum level6 level1 level7)
(sum level6 level5 level11)
(sum level6 level9 level15)
(sum level6 level15 level21)
(sum level6 level20 level26)
(sum level6 level21 level27)
(sum level6 level25 level31)
(sum level7 level1 level8)
(sum level7 level5 level12)
(sum level7 level9 level16)
(sum level7 level15 level22)
(sum level7 level20 level27)
(sum level7 level21 level28)
(sum level7 level25 level32)
(sum level8 level1 level9)
(sum level8 level5 level13)
(sum level8 level9 level17)
(sum level8 level15 level23)
(sum level8 level20 level28)
(sum level8 level21 level29)
(sum level8 level25 level33)
(sum level9 level1 level10)
(sum level9 level5 level14)
(sum level9 level9 level18)
(sum level9 level15 level24)
(sum level9 level20 level29)
(sum level9 level21 level30)
(sum level9 level25 level34)
(sum level10 level1 level11)
(sum level10 level5 level15)
(sum level10 level9 level19)
(sum level10 level15 level25)
(sum level10 level20 level30)
(sum level10 level21 level31)
(sum level10 level25 level35)
(sum level11 level1 level12)
(sum level11 level5 level16)
(sum level11 level9 level20)
(sum level11 level15 level26)
(sum level11 level20 level31)
(sum level11 level21 level32)
(sum level11 level25 level36)
(sum level12 level1 level13)
(sum level12 level5 level17)
(sum level12 level9 level21)
(sum level12 level15 level27)
(sum level12 level20 level32)
(sum level12 level21 level33)
(sum level12 level25 level37)
(sum level13 level1 level14)
(sum level13 level5 level18)
(sum level13 level9 level22)
(sum level13 level15 level28)
(sum level13 level20 level33)
(sum level13 level21 level34)
(sum level13 level25 level38)
(sum level14 level1 level15)
(sum level14 level5 level19)
(sum level14 level9 level23)
(sum level14 level15 level29)
(sum level14 level20 level34)
(sum level14 level21 level35)
(sum level14 level25 level39)
(sum level15 level1 level16)
(sum level15 level5 level20)
(sum level15 level9 level24)
(sum level15 level15 level30)
(sum level15 level20 level35)
(sum level15 level21 level36)
(sum level15 level25 level40)
(sum level16 level1 level17)
(sum level16 level5 level21)
(sum level16 level9 level25)
(sum level16 level15 level31)
(sum level16 level20 level36)
(sum level16 level21 level37)
(sum level16 level25 level41)
(sum level17 level1 level18)
(sum level17 level5 level22)
(sum level17 level9 level26)
(sum level17 level15 level32)
(sum level17 level20 level37)
(sum level17 level21 level38)
(sum level17 level25 level42)
(sum level18 level1 level19)
(sum level18 level5 level23)
(sum level18 level9 level27)
(sum level18 level15 level33)
(sum level18 level20 level38)
(sum level18 level21 level39)
(sum level18 level25 level43)
(sum level19 level1 level20)
(sum level19 level5 level24)
(sum level19 level9 level28)
(sum level19 level15 level34)
(sum level19 level20 level39)
(sum level19 level21 level40)
(sum level19 level25 level44)
(sum level20 level1 level21)
(sum level20 level5 level25)
(sum level20 level9 level29)
(sum level20 level15 level35)
(sum level20 level20 level40)
(sum level20 level21 level41)
(sum level20 level25 level45)
(sum level21 level1 level22)
(sum level21 level5 level26)
(sum level21 level9 level30)
(sum level21 level15 level36)
(sum level21 level20 level41)
(sum level21 level21 level42)
(sum level21 level25 level46)
(sum level22 level1 level23)
(sum level22 level5 level27)
(sum level22 level9 level31)
(sum level22 level15 level37)
(sum level22 level20 level42)
(sum level22 level21 level43)
(sum level22 level25 level47)
(sum level23 level1 level24)
(sum level23 level5 level28)
(sum level23 level9 level32)
(sum level23 level15 level38)
(sum level23 level20 level43)
(sum level23 level21 level44)
(sum level23 level25 level48)
(sum level24 level1 level25)
(sum level24 level5 level29)
(sum level24 level9 level33)
(sum level24 level15 level39)
(sum level24 level20 level44)
(sum level24 level21 level45)
(sum level24 level25 level49)
(sum level25 level1 level26)
(sum level25 level5 level30)
(sum level25 level9 level34)
(sum level25 level15 level40)
(sum level25 level20 level45)
(sum level25 level21 level46)
(sum level25 level25 level50)
(sum level26 level1 level27)
(sum level26 level5 level31)
(sum level26 level9 level35)
(sum level26 level15 level41)
(sum level26 level20 level46)
(sum level26 level21 level47)
(sum level26 level25 level51)
(sum level27 level1 level28)
(sum level27 level5 level32)
(sum level27 level9 level36)
(sum level27 level15 level42)
(sum level27 level20 level47)
(sum level27 level21 level48)
(sum level27 level25 level52)
(sum level28 level1 level29)
(sum level28 level5 level33)
(sum level28 level9 level37)
(sum level28 level15 level43)
(sum level28 level20 level48)
(sum level28 level21 level49)
(sum level28 level25 level53)
(sum level29 level1 level30)
(sum level29 level5 level34)
(sum level29 level9 level38)
(sum level29 level15 level44)
(sum level29 level20 level49)
(sum level29 level21 level50)
(sum level29 level25 level54)
(sum level30 level1 level31)
(sum level30 level5 level35)
(sum level30 level9 level39)
(sum level30 level15 level45)
(sum level30 level20 level50)
(sum level30 level21 level51)
(sum level30 level25 level55)
(sum level31 level1 level32)
(sum level31 level5 level36)
(sum level31 level9 level40)
(sum level31 level15 level46)
(sum level31 level20 level51)
(sum level31 level21 level52)
(sum level31 level25 level56)
(sum level32 level1 level33)
(sum level32 level5 level37)
(sum level32 level9 level41)
(sum level32 level15 level47)
(sum level32 level20 level52)
(sum level32 level21 level53)
(sum level32 level25 level57)
(sum level33 level1 level34)
(sum level33 level5 level38)
(sum level33 level9 level42)
(sum level33 level15 level48)
(sum level33 level20 level53)
(sum level33 level21 level54)
(sum level33 level25 level58)
(sum level34 level1 level35)
(sum level34 level5 level39)
(sum level34 level9 level43)
(sum level34 level15 level49)
(sum level34 level20 level54)
(sum level34 level21 level55)
(sum level34 level25 level59)
(sum level35 level1 level36)
(sum level35 level5 level40)
(sum level35 level9 level44)
(sum level35 level15 level50)
(sum level35 level20 level55)
(sum level35 level21 level56)
(sum level35 level25 level60)
(sum level36 level1 level37)
(sum level36 level5 level41)
(sum level36 level9 level45)
(sum level36 level15 level51)
(sum level36 level20 level56)
(sum level36 level21 level57)
(sum level36 level25 level61)
(sum level37 level1 level38)
(sum level37 level5 level42)
(sum level37 level9 level46)
(sum level37 level15 level52)
(sum level37 level20 level57)
(sum level37 level21 level58)
(sum level37 level25 level62)
(sum level38 level1 level39)
(sum level38 level5 level43)
(sum level38 level9 level47)
(sum level38 level15 level53)
(sum level38 level20 level58)
(sum level38 level21 level59)
(sum level38 level25 level63)
(sum level39 level1 level40)
(sum level39 level5 level44)
(sum level39 level9 level48)
(sum level39 level15 level54)
(sum level39 level20 level59)
(sum level39 level21 level60)
(sum level39 level25 level64)
(sum level40 level1 level41)
(sum level40 level5 level45)
(sum level40 level9 level49)
(sum level40 level15 level55)
(sum level40 level20 level60)
(sum level40 level21 level61)
(sum level40 level25 level65)
(sum level41 level1 level42)
(sum level41 level5 level46)
(sum level41 level9 level50)
(sum level41 level15 level56)
(sum level41 level20 level61)
(sum level41 level21 level62)
(sum level41 level25 level66)
(sum level42 level1 level43)
(sum level42 level5 level47)
(sum level42 level9 level51)
(sum level42 level15 level57)
(sum level42 level20 level62)
(sum level42 level21 level63)
(sum level42 level25 level67)
(sum level43 level1 level44)
(sum level43 level5 level48)
(sum level43 level9 level52)
(sum level43 level15 level58)
(sum level43 level20 level63)
(sum level43 level21 level64)
(sum level43 level25 level68)
(sum level44 level1 level45)
(sum level44 level5 level49)
(sum level44 level9 level53)
(sum level44 level15 level59)
(sum level44 level20 level64)
(sum level44 level21 level65)
(sum level44 level25 level69)
(sum level45 level1 level46)
(sum level45 level5 level50)
(sum level45 level9 level54)
(sum level45 level15 level60)
(sum level45 level20 level65)
(sum level45 level21 level66)
(sum level45 level25 level70)
(sum level46 level1 level47)
(sum level46 level5 level51)
(sum level46 level9 level55)
(sum level46 level15 level61)
(sum level46 level20 level66)
(sum level46 level21 level67)
(sum level46 level25 level71)
(sum level47 level1 level48)
(sum level47 level5 level52)
(sum level47 level9 level56)
(sum level47 level15 level62)
(sum level47 level20 level67)
(sum level47 level21 level68)
(sum level47 level25 level72)
(sum level48 level1 level49)
(sum level48 level5 level53)
(sum level48 level9 level57)
(sum level48 level15 level63)
(sum level48 level20 level68)
(sum level48 level21 level69)
(sum level48 level25 level73)
(sum level49 level1 level50)
(sum level49 level5 level54)
(sum level49 level9 level58)
(sum level49 level15 level64)
(sum level49 level20 level69)
(sum level49 level21 level70)
(sum level49 level25 level74)
(sum level50 level1 level51)
(sum level50 level5 level55)
(sum level50 level9 level59)
(sum level50 level15 level65)
(sum level50 level20 level70)
(sum level50 level21 level71)
(sum level50 level25 level75)
(sum level51 level1 level52)
(sum level51 level5 level56)
(sum level51 level9 level60)
(sum level51 level15 level66)
(sum level51 level20 level71)
(sum level51 level21 level72)
(sum level51 level25 level76)
(sum level52 level1 level53)
(sum level52 level5 level57)
(sum level52 level9 level61)
(sum level52 level15 level67)
(sum level52 level20 level72)
(sum level52 level21 level73)
(sum level52 level25 level77)
(sum level53 level1 level54)
(sum level53 level5 level58)
(sum level53 level9 level62)
(sum level53 level15 level68)
(sum level53 level20 level73)
(sum level53 level21 level74)
(sum level53 level25 level78)
(sum level54 level1 level55)
(sum level54 level5 level59)
(sum level54 level9 level63)
(sum level54 level15 level69)
(sum level54 level20 level74)
(sum level54 level21 level75)
(sum level54 level25 level79)
(sum level55 level1 level56)
(sum level55 level5 level60)
(sum level55 level9 level64)
(sum level55 level15 level70)
(sum level55 level20 level75)
(sum level55 level21 level76)
(sum level55 level25 level80)
(sum level56 level1 level57)
(sum level56 level5 level61)
(sum level56 level9 level65)
(sum level56 level15 level71)
(sum level56 level20 level76)
(sum level56 level21 level77)
(sum level56 level25 level81)
(sum level57 level1 level58)
(sum level57 level5 level62)
(sum level57 level9 level66)
(sum level57 level15 level72)
(sum level57 level20 level77)
(sum level57 level21 level78)
(sum level57 level25 level82)
(sum level58 level1 level59)
(sum level58 level5 level63)
(sum level58 level9 level67)
(sum level58 level15 level73)
(sum level58 level20 level78)
(sum level58 level21 level79)
(sum level58 level25 level83)
(sum level59 level1 level60)
(sum level59 level5 level64)
(sum level59 level9 level68)
(sum level59 level15 level74)
(sum level59 level20 level79)
(sum level59 level21 level80)
(sum level59 level25 level84)
(sum level60 level1 level61)
(sum level60 level5 level65)
(sum level60 level9 level69)
(sum level60 level15 level75)
(sum level60 level20 level80)
(sum level60 level21 level81)
(sum level60 level25 level85)
(sum level61 level1 level62)
(sum level61 level5 level66)
(sum level61 level9 level70)
(sum level61 level15 level76)
(sum level61 level20 level81)
(sum level61 level21 level82)
(sum level61 level25 level86)
(sum level62 level1 level63)
(sum level62 level5 level67)
(sum level62 level9 level71)
(sum level62 level15 level77)
(sum level62 level20 level82)
(sum level62 level21 level83)
(sum level62 level25 level87)
(sum level63 level1 level64)
(sum level63 level5 level68)
(sum level63 level9 level72)
(sum level63 level15 level78)
(sum level63 level20 level83)
(sum level63 level21 level84)
(sum level63 level25 level88)
(sum level64 level1 level65)
(sum level64 level5 level69)
(sum level64 level9 level73)
(sum level64 level15 level79)
(sum level64 level20 level84)
(sum level64 level21 level85)
(sum level64 level25 level89)
(sum level65 level1 level66)
(sum level65 level5 level70)
(sum level65 level9 level74)
(sum level65 level15 level80)
(sum level65 level20 level85)
(sum level65 level21 level86)
(sum level65 level25 level90)
(sum level66 level1 level67)
(sum level66 level5 level71)
(sum level66 level9 level75)
(sum level66 level15 level81)
(sum level66 level20 level86)
(sum level66 level21 level87)
(sum level66 level25 level91)
(sum level67 level1 level68)
(sum level67 level5 level72)
(sum level67 level9 level76)
(sum level67 level15 level82)
(sum level67 level20 level87)
(sum level67 level21 level88)
(sum level67 level25 level92)
(sum level68 level1 level69)
(sum level68 level5 level73)
(sum level68 level9 level77)
(sum level68 level15 level83)
(sum level68 level20 level88)
(sum level68 level21 level89)
(sum level68 level25 level93)
(sum level69 level1 level70)
(sum level69 level5 level74)
(sum level69 level9 level78)
(sum level69 level15 level84)
(sum level69 level20 level89)
(sum level69 level21 level90)
(sum level69 level25 level94)
(sum level70 level1 level71)
(sum level70 level5 level75)
(sum level70 level9 level79)
(sum level70 level15 level85)
(sum level70 level20 level90)
(sum level70 level21 level91)
(sum level70 level25 level95)
(sum level71 level1 level72)
(sum level71 level5 level76)
(sum level71 level9 level80)
(sum level71 level15 level86)
(sum level71 level20 level91)
(sum level71 level21 level92)
(sum level71 level25 level96)
(sum level72 level1 level73)
(sum level72 level5 level77)
(sum level72 level9 level81)
(sum level72 level15 level87)
(sum level72 level20 level92)
(sum level72 level21 level93)
(sum level72 level25 level97)
(sum level73 level1 level74)
(sum level73 level5 level78)
(sum level73 level9 level82)
(sum level73 level15 level88)
(sum level73 level20 level93)
(sum level73 level21 level94)
(sum level73 level25 level98)
(sum level74 level1 level75)
(sum level74 level5 level79)
(sum level74 level9 level83)
(sum level74 level15 level89)
(sum level74 level20 level94)
(sum level74 level21 level95)
(sum level74 level25 level99)
(sum level75 level1 level76)
(sum level75 level5 level80)
(sum level75 level9 level84)
(sum level75 level15 level90)
(sum level75 level20 level95)
(sum level75 level21 level96)
(sum level75 level25 level100)
(sum level76 level1 level77)
(sum level76 level5 level81)
(sum level76 level9 level85)
(sum level76 level15 level91)
(sum level76 level20 level96)
(sum level76 level21 level97)
(sum level76 level25 level101)
(sum level77 level1 level78)
(sum level77 level5 level82)
(sum level77 level9 level86)
(sum level77 level15 level92)
(sum level77 level20 level97)
(sum level77 level21 level98)
(sum level77 level25 level102)
(sum level78 level1 level79)
(sum level78 level5 level83)
(sum level78 level9 level87)
(sum level78 level15 level93)
(sum level78 level20 level98)
(sum level78 level21 level99)
(sum level78 level25 level103)
(sum level79 level1 level80)
(sum level79 level5 level84)
(sum level79 level9 level88)
(sum level79 level15 level94)
(sum level79 level20 level99)
(sum level79 level21 level100)
(sum level79 level25 level104)
(sum level80 level1 level81)
(sum level80 level5 level85)
(sum level80 level9 level89)
(sum level80 level15 level95)
(sum level80 level20 level100)
(sum level80 level21 level101)
(sum level80 level25 level105)
(sum level81 level1 level82)
(sum level81 level5 level86)
(sum level81 level9 level90)
(sum level81 level15 level96)
(sum level81 level20 level101)
(sum level81 level21 level102)
(sum level81 level25 level106)
(sum level82 level1 level83)
(sum level82 level5 level87)
(sum level82 level9 level91)
(sum level82 level15 level97)
(sum level82 level20 level102)
(sum level82 level21 level103)
(sum level82 level25 level107)
(sum level83 level1 level84)
(sum level83 level5 level88)
(sum level83 level9 level92)
(sum level83 level15 level98)
(sum level83 level20 level103)
(sum level83 level21 level104)
(sum level83 level25 level108)
(sum level84 level1 level85)
(sum level84 level5 level89)
(sum level84 level9 level93)
(sum level84 level15 level99)
(sum level84 level20 level104)
(sum level84 level21 level105)
(sum level84 level25 level109)
(sum level85 level1 level86)
(sum level85 level5 level90)
(sum level85 level9 level94)
(sum level85 level15 level100)
(sum level85 level20 level105)
(sum level85 level21 level106)
(sum level85 level25 level110)
(sum level86 level1 level87)
(sum level86 level5 level91)
(sum level86 level9 level95)
(sum level86 level15 level101)
(sum level86 level20 level106)
(sum level86 level21 level107)
(sum level86 level25 level111)
(sum level87 level1 level88)
(sum level87 level5 level92)
(sum level87 level9 level96)
(sum level87 level15 level102)
(sum level87 level20 level107)
(sum level87 level21 level108)
(sum level87 level25 level112)
(sum level88 level1 level89)
(sum level88 level5 level93)
(sum level88 level9 level97)
(sum level88 level15 level103)
(sum level88 level20 level108)
(sum level88 level21 level109)
(sum level89 level1 level90)
(sum level89 level5 level94)
(sum level89 level9 level98)
(sum level89 level15 level104)
(sum level89 level20 level109)
(sum level89 level21 level110)
(sum level90 level1 level91)
(sum level90 level5 level95)
(sum level90 level9 level99)
(sum level90 level15 level105)
(sum level90 level20 level110)
(sum level90 level21 level111)
(sum level91 level1 level92)
(sum level91 level5 level96)
(sum level91 level9 level100)
(sum level91 level15 level106)
(sum level91 level20 level111)
(sum level91 level21 level112)
(sum level92 level1 level93)
(sum level92 level5 level97)
(sum level92 level9 level101)
(sum level92 level15 level107)
(sum level92 level20 level112)
(sum level93 level1 level94)
(sum level93 level5 level98)
(sum level93 level9 level102)
(sum level93 level15 level108)
(sum level94 level1 level95)
(sum level94 level5 level99)
(sum level94 level9 level103)
(sum level94 level15 level109)
(sum level95 level1 level96)
(sum level95 level5 level100)
(sum level95 level9 level104)
(sum level95 level15 level110)
(sum level96 level1 level97)
(sum level96 level5 level101)
(sum level96 level9 level105)
(sum level96 level15 level111)
(sum level97 level1 level98)
(sum level97 level5 level102)
(sum level97 level9 level106)
(sum level97 level15 level112)
(sum level98 level1 level99)
(sum level98 level5 level103)
(sum level98 level9 level107)
(sum level99 level1 level100)
(sum level99 level5 level104)
(sum level99 level9 level108)
(sum level100 level1 level101)
(sum level100 level5 level105)
(sum level100 level9 level109)
(sum level101 level1 level102)
(sum level101 level5 level106)
(sum level101 level9 level110)
(sum level102 level1 level103)
(sum level102 level5 level107)
(sum level102 level9 level111)
(sum level103 level1 level104)
(sum level103 level5 level108)
(sum level103 level9 level112)
(sum level104 level1 level105)
(sum level104 level5 level109)
(sum level105 level1 level106)
(sum level105 level5 level110)
(sum level106 level1 level107)
(sum level106 level5 level111)
(sum level107 level1 level108)
(sum level107 level5 level112)
(sum level108 level1 level109)
(sum level109 level1 level110)
(sum level110 level1 level111)
(sum level111 level1 level112)

(connected l0 l2)
(fuelcost level21 l0 l2)
(connected l0 l5)
(fuelcost level1 l0 l5)
(connected l1 l2)
(fuelcost level1 l1 l2)
(connected l1 l5)
(fuelcost level9 l1 l5)
(connected l1 l6)
(fuelcost level1 l1 l6)
(connected l2 l0)
(fuelcost level21 l2 l0)
(connected l2 l1)
(fuelcost level1 l2 l1)
(connected l2 l5)
(fuelcost level5 l2 l5)
(connected l3 l4)
(fuelcost level15 l3 l4)
(connected l3 l6)
(fuelcost level20 l3 l6)
(connected l4 l3)
(fuelcost level15 l4 l3)
(connected l4 l6)
(fuelcost level5 l4 l6)
(connected l5 l0)
(fuelcost level1 l5 l0)
(connected l5 l1)
(fuelcost level9 l5 l1)
(connected l5 l2)
(fuelcost level5 l5 l2)
(connected l5 l6)
(fuelcost level25 l5 l6)
(connected l6 l1)
(fuelcost level1 l6 l1)
(connected l6 l3)
(fuelcost level20 l6 l3)
(connected l6 l4)
(fuelcost level5 l6 l4)
(connected l6 l5)
(fuelcost level25 l6 l5)

(at t0 l0)
(fuel t0 level112)
(= (total-cost) 0)

(at p0 l3)
(at p1 l2)
(at p2 l0)
(at p3 l0)
(at p4 l6)
(at p5 l0)
(at p6 l0)
(at p7 l6)
(at p8 l4)
(at p9 l2)
)

(:goal
(and
(at p0 l0)
(at p1 l1)
(at p2 l5)
(at p3 l1)
(at p4 l4)
(at p5 l1)
(at p6 l5)
(at p7 l3)
(at p8 l2)
(at p9 l6)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 0 of 10
2. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 0 of 10
3. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 0 of 10
4. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 0 of 10
5. (drive t0 l0 l2 level91 level21 level112)
   deleted: (at t0 l0) (fuel t0 level112)
   added: (at t0 l2) (fuel t0 level91)
   goals met: 0 of 10
6. (load p9 t0 l2)
   deleted: (at p9 l2)
   added: (in p9 t0)
   goals met: 0 of 10
7. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 0 of 10
8. (drive t0 l2 l1 level90 level1 level91)
   deleted: (at t0 l2) (fuel t0 level91)
   added: (at t0 l1) (fuel t0 level90)
   goals met: 0 of 10
9. (unload p5 t0 l1)
   deleted: (in p5 t0)
   added: (at p5 l1)
   goals met: 1 of 10
10. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 2 of 10
11. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 3 of 10
12. (drive t0 l1 l6 level89 level1 level90)
   deleted: (at t0 l1) (fuel t0 level90)
   added: (at t0 l6) (fuel t0 level89)
   goals met: 3 of 10
13. (unload p9 t0 l6)
   deleted: (in p9 t0)
   added: (at p9 l6)
   goals met: 4 of 10
14. (load p7 t0 l6)
   deleted: (at p7 l6)
   added: (in p7 t0)
   goals met: 4 of 10
15. (load p4 t0 l6)
   deleted: (at p4 l6)
   added: (in p4 t0)
   goals met: 4 of 10
16. (drive t0 l6 l3 level69 level20 level89)
   deleted: (at t0 l6) (fuel t0 level89)
   added: (at t0 l3) (fuel t0 level69)
   goals met: 4 of 10
17. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 4 of 10
18. (unload p7 t0 l3)
   deleted: (in p7 t0)
   added: (at p7 l3)
   goals met: 5 of 10
19. (drive t0 l3 l4 level54 level15 level69)
   deleted: (at t0 l3) (fuel t0 level69)
   added: (at t0 l4) (fuel t0 level54)
   goals met: 5 of 10
20. (load p8 t0 l4)
   deleted: (at p8 l4)
   added: (in p8 t0)
   goals met: 5 of 10
21. (unload p4 t0 l4)
   deleted: (in p4 t0)
   added: (at p4 l4)
   goals met: 6 of 10
22. (drive t0 l4 l6 level49 level5 level54)
   deleted: (at t0 l4) (fuel t0 level54)
   added: (at t0 l6) (fuel t0 level49)
   goals met: 6 of 10
23. (drive t0 l6 l5 level24 level25 level49)
   deleted: (at t0 l6) (fuel t0 level49)
   added: (at t0 l5) (fuel t0 level24)
   goals met: 6 of 10
24. (unload p2 t0 l5)
   deleted: (in p2 t0)
   added: (at p2 l5)
   goals met: 7 of 10
25. (unload p6 t0 l5)
   deleted: (in p6 t0)
   added: (at p6 l5)
   goals met: 8 of 10
26. (drive t0 l5 l0 level23 level1 level24)
   deleted: (at t0 l5) (fuel t0 level24)
   added: (at t0 l0) (fuel t0 level23)
   goals met: 8 of 10
27. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 9 of 10
28. (drive t0 l0 l2 level2 level21 level23)
   deleted: (at t0 l0) (fuel t0 level23)
   added: (at t0 l2) (fuel t0 level2)
   goals met: 9 of 10
29. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 10 of 10
